# ------------------------------------------------------------------------------------
# INVENTORY 库存&存货统计程序-主数据对象
#
# author:gbench@sina.com
# date: 2025-03-12
# ------------------------------------------------------------------------------------

# 产品列表
products <- c("苹果" = "apple001", "香蕉" = "banana001", "草莓" = "strawberry001") # 产品列表
# 公司列表
companies <- c("中国第一出口公司" = "001", "华北进出口公司" = "002") # 公司
# 仓库列表
warehouses <- c("北京仓库" = "001", "上海仓库" = "002") # 产品列表

# 默认统计公式
default_path <- "cbind(total_in, total_out, qty, times) ~ name + date + company_id + warehouse_id"
